from bocchi.configs.path_config import TEMP_PATH

# SIGN_TODAY_CARD_PATH = IMAGE_PATH / "sign" / "today_card"
SIGN_TODAY_CARD_PATH = TEMP_PATH /"sign"

lik2relation = {
    "0": "路人",
    "1": "陌生",
    "2": "初识",
    "3": "普通",
    "4": "熟悉",
    "5": "信赖",
    "6": "相知",
    "7": "厚谊",
    "8": "亲密",
}

level2attitude = {
    "0": "陌生",   # 基本没有好感，还保持距离
    "1": "可以交流",     # 愿意聊，但不深入
    "2": "一般",     # 普通同学/同事，不亲不疏
    "3": "值得信赖",     # 觉得对方靠谱，可以依靠
    "4": "普通朋友",         # 关系亲近，愿意主动接触
    "5": "好朋友",       # 有一定的信任感和默契
    "6": "亲密朋友",     # 能分享心事、小秘密
    "7": "特别喜欢",     # 好感上升，有暧昧/喜欢的感觉
    "8": "恋人",    # 最亲密的关系
}


weekdays = {1: "Mon", 2: "Tue", 3: "Wed", 4: "Thu", 5: "Fri", 6: "Sat", 7: "Sun"}

lik2level = {
    2280: "8",
    1390: "7",
    840: "6",
    500: "5",
    290: "4",
    160: "3",
    80: "2",
    30: "1",
    0: "0",
}